///例题2.2 二分搜索算法
/*********************************************************
* 这个search函数检查数v是否在一个事先存储的数的集合a[l],
* a[l+1],...,a[r]中。从第一个元素开始，顺序比较每个元素，
* 如果到达末尾而未找到所要找的数，那么返回值为-1。否则，
* 返回这个数所在数组位置处的下标。
* 效率更高
*********************************************************/

#include <stdio.h>

int search(int a[], int v, int l, int r)
{
    while(r >= l)
    {
        int m = (l+r)/2;
        if(v == a[m]) return m;
        if(v < a[m]) r = m-1;
        else l = m+1;
    }
    return -1;
}

int main()
{
    int sort_array[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};
    int b;
    b = search(sort_array, 8, 4, 7);
    printf("%d",b);
}
