///例题2.1 顺序搜索算法
/*********************************************************
* 这个search函数检查数v是否在一个事先存储的数的集合a[l],
* a[l+1],...,a[r]中。从第一个元素开始，顺序比较每个元素，
* 如果到达末尾而未找到所要找的数，那么返回值为-1。否则，
* 返回这个数所在数组位置处的下标。
*********************************************************/

#include <stdio.h>

int search(int a[], int v, int l, int r)
{
    int i;
    for(i=l; i<=r; i++)
        if(v == a[i]) return i;
    return -1;
}

int main()
{
    int sort_array[10] = {10, 8, 3, 4, 6, 7, 2, 1, 9, 5};
    int b;
    b = search(sort_array, 1, 4, 8);
    printf("%d",b);
}
